# Вычислить число π c заданной точностью d
# Пример:
# - при $d = 0.001, π = 3.141.$    $10^{-1} ≤ d ≤10^{-10}$
N = int(input('Введите необходимое количество знаков числа π: '))
i = S1 = S2 = 0
Precision = 10**(-(N+1))
flag = True
while(flag):
    i += 1
    S1 = S2 + 4 / (2*i - 1)
    i += 1
    S2 = S1 - 4 / (2*i - 1)
    flag = ((S1 - S2) > Precision)
    
print(f'Через {i} итераций вычисленно число π: {round((S1 + S2) / 2, N)} ')
