# Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]
from random import randint
N = int(input('Введите размер списка: '))
a = [randint(1, 100) for i in range(N)]
print('Исходный список: ', *a)
result = []
resLen = N // 2 + N % 2
for i in range(resLen):
    result.append(a[i] * a[-i - 1])
print('Массив произведений = ', end='')
print(*result)
